Revit 2027 API
ExternalServices.BuiltInExternalServices.ExternalParameterService Property
 Autodesk Internal: The service for shared parameter selection.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ExternalParameterService { get; }
Public Shared ReadOnly Property ExternalParameterService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ExternalParameterService {
	ExternalServiceId^ get ();
}
static member ExternalParameterService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace